export const ROLES_BY_PLACE = {
    "유람선": ["선장", "바텐더", "부자", "웨이터", "셰프", "음악가", "정비공"],
    "극장": ["무대 매니저", "오퍼레이터", "악단 지휘자", "관객", "감독", "배우", "엑스트라"],
    "편의점": ["아르바이트", "담배 사는 청소년", "주정뱅이", "대학생", "매니저", "꼬맹이", "유통기사"],
    "비행기": ["기장", "이코노미승객", "퍼스트클래스", "부기장", "정비공", "스튜어디스", "보안책임자"],
    "은행": ["매니저", "무장차량 운전수", "손님", "창구 직원", "보안팀장", "도둑", "컨설턴트"],
    "레스토랑": ["뮤지션", "손님", "비평가", "도어맨", "웨이터", "수셰프", "셰프"],
    "학교": ["영양사", "국어선생님", "수학선생님", "영어선생님", "과학선생님", "학생", "교장선생님"],
    "영화촬영장": ["감독", "스턴트맨", "카메라맨", "배우", "프로듀서", "코디", "사운드 엔지니어"],
    "회사파티": ["초청가수", "비서", "회계사", "초대 못 받은 사람", "사장", "이사", "가수의 매니저"],
    "카지노": ["바텐더", "딜러", "도박꾼", "매니저", "바람잡이", "빈털털이", "호구"],
    "군대": ["또라이", "고문관", "중대장", "행보관", "A급신병", "일병", "말년병장"],
    "잠수함": ["항해사", "어뢰사수", "탐지병", "공병", "취사병", "지휘관", "통신병"],
    "십자군": ["궁수", "종자", "사제", "수도승", "기사", "하인", "죄인"],
    "남극기지": ["지질학자", "의무관", "생태학자", "통신반장", "탐험대장", "기상학자", "기술자"],
    "우주정거장": ["파일럿", "과학자", "관광객", "지휘관", "기술자", "에일리언", "의사"],
    "해적선": ["포수", "항해사", "선장", "갑판원", "노예", "요리사", "포로"],
    "병원": ["환자", "인턴", "간호사", "내과의", "외과의", "청소부", "원장"],
    "차량정비소": ["폭주족", "매니저", "기계 정비공", "아르바이트", "차주인", "타이어 정비공", "전기 정비공"],
    "유흥가": ["마담", "바텐더", "스트리퍼", "마약쟁이", "위장경찰", "회사원", "깡패"],
    "대학교": ["대학원생", "학생", "교수", "조교", "관리자", "휴학생", "학생회장"],
    "대성당": ["동네 사람", "합창단", "화가", "집시", "죄인", "신부님", "신도"]
}

export type Place = keyof typeof ROLES_BY_PLACE;